namespace task3
{
    internal class Program
    {
        static void Main(string[] args)
        {
         int //بتعبر عن اعداد صحيحه
          uint //   بتعبر عن اعداد صحيحه موجبه   
                short //بيعبر عن اعداد صحيح لكن سعته اصغر منint
                ushort//بيعبر عن اعداد صحيح موجبه لكن سعته اصغر منuint
                long //بيعبر عن اعداد صحيحه لكن سعته اكبر من int
                ulong//بيعبر عن اعداد صحيحه لكن سعته اكبر من uint
                float//بيعبر عن اعداد بتحتوي علي اعداد عشريه
                double//بيعبر عن اعداد بتحتوي علي اعداد عشريه لكن سعته اكبر من float
                decimal//بيستخدم لتخزين الارقام العشريه
                var//بيحدد نوعه من قيمة الvariable



        }
    }
}
